Revit 2027 API
CableTraySizes.AddSize Method
 Inserts a new MEPSize into the cable tray sizes. For cable tray, the nominal diameter of MEPSize is used .
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSize(
	MEPSize sizeInfo
)
Public Sub AddSize (
	sizeInfo As MEPSize
)
public:
void AddSize(
	MEPSize^ sizeInfo
)
member AddSize :
        sizeInfo : MEPSize -> unit
Parameters
sizeInfo MEPSize
 The new MEPSize to be added.
Exceptions
Exception | Condition
ArgumentException |  There is already the same size in the size set.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The function is called during iterating the size set.
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace